week_2/quiz_2.tex
% Created 2024-07-12 Fri 07:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Graded Quiz 2}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Graded Quiz 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:org57cd1c6}

\textbf{Answer:} 3\\

First, consider the best option for Player 1 for each strategy of Player 2:
\begin{itemize}
\item Player 2 chooses X: Player 1 chooses C;
\item Player 2 chooses Y: Player 1 chooses B;
\item Player 2 chooses Z: Player 1 chooses A or C.
\end{itemize}
Next, consider the best option for Player 2 for each strategy of Player 1:
\begin{itemize}
\item Player 1 chooses A: Player 2 chooses X or Z;
\item Player 1 chooses B: Player 2 chooses Y;
\item Player 1 chooses C: Player 2 chooses X.
\end{itemize}
Therefore, there are \textbf{3 Nash equilibria}:
\begin{itemize}
\item Player 1 chooses A and Player 2 chooses Z;
\item Player 1 chooses B and Player 2 chooses Y;
\item Player 1 chooses C and Player 2 chooses X.
\end{itemize}
\section*{Problem 2}
\label{sec:org47f38fa}

\textbf{Answer:} Belief disagreement may lead to non-Nash outcomes, and its realization
is unpredictable.
\section*{Problem 3}
\label{sec:org40e5613}

\textbf{Answer:} In a Nash equilibrium, both players choose C.\\

First, consider the best option for Player 1 for each strategy of Player 2:
\begin{itemize}
\item Player 2 chooses A: Player 1 chooses C;
\item Player 2 chooses B: Player 1 chooses C;
\item Player 2 chooses C: Player 1 chooses C.
\end{itemize}
\textbf{The best strategy for Player 1 is always C}.\\
Next, consider the best option for Player 2 for each strategy of Player 1:
\begin{itemize}
\item Player 1 chooses A: Player 2 chooses C;
\item Player 1 chooses B: Player 2 chooses C;
\item Player 1 chooses C: Player 2 chooses C.
\end{itemize}
\textbf{The best strategy for Player 2 is always C}. Therefore, \textbf{a Nash equilibrium DOES
exist}, and it corresponds to the situation where \textbf{both players choose C}.
\section*{Problem 4}
\label{sec:org987fc38}

\textbf{Answer:} This game is similar to the prisoner's dilemma in that it has a better
outcome than Nash equilibrium for all players.\\

If both players chose strategy B, that would be better for both of them.
\section*{Problem 5}
\label{sec:orgf9acbf8}

\textbf{Answer:}
\begin{itemize}
\item Version 1: To play a game many times and have better and better beliefs
against others' behavior.
\item Version 2:
\begin{itemize}
\item There can be many Nash equilibria in a game.
\item The \emph{de facto} standard of a new technology may not be efficient.
\item A game might have good and bad Nash equilibria (the former are better than
the latter for everyone).
\end{itemize}
\end{itemize}
\section*{Problem 6}
\label{sec:org5955ccd}

\textbf{Answer:} The prisoner's dilemma, because defection is best for both players and
they do not consider that mutual cooperation can be attained.
\section*{Problem 7}
\label{sec:org8b93808}

\textbf{Answer:}
\begin{itemize}
\item Version 1: Agreement is fulfilled without imposing penalty or reward.
\item Version 2: There is no guarantee that such an adjustment process always
converges to a Nash equilibrium.
\end{itemize}
\end{document}
